---
kind: property
id: P:Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.MassSubCategoryId
source: html/068a23bd-bc73-2090-f607-ea1b5e4612dd.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.MassSubCategoryId Property

The mass subcategory id of the ConceptualSurfaceType.

## Syntax (C#)
```csharp
public ElementId MassSubCategoryId { get; }
```